MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/inc/hc32f46x_sdioc.h
        en_sdioc_response_index_t enRspIndex; ///< Response index, refer @ref en_sdioc_response_index_t for details

        en_functional_state_t enDataPresentEnable; ///< Enable: Data is present and shall be transferred using the DAT line, Disable:  Commands using only CMD line
    } stc_sdioc_cmd_cfg_t;

    /**
     *******************************************************************************
     ** \brief SDIOC Data configure structure
     **
     ******************************************************************************/
    typedef struct stc_sdioc_data_cfg
    {
        uint16_t u16BlkSize; ///< Block size

        uint16_t u16BlkCnt; ///< Block count

        en_functional_state_t enAutoCmd12Enable; ///< Enable: Auto CMD12 enable, Disable: Auto CMD12 disable

        en_sdioc_transfer_dir_t enTransferDir; ///< Specifies the data transfer direction of the SDIOC controller.
                                               ///< This parameter can be a value of @ref en_sdioc_transfer_dir_t.

        en_sdioc_data_timeout_t enDataTimeOut; ///< Specifies the data timeout period in card bus clock periods.
                                               ///< This parameter can be a value of @ref en_sdioc_data_timeout_t.

        en_sdioc_transfer_mode_t enTransferMode; ///< Specifies the data transfer mode of the SDIOC controller.
                                                 ///< This parameter can be a value of @ref en_sdioc_transfer_mode_t.
    } stc_sdioc_data_cfg_t;

    /**
     *******************************************************************************
     ** \brief SDIOC normal interrupt enable structure
     **
     ******************************************************************************/
    typedef struct stc_sdioc_normal_irq_en
    {
        union
        {
            uint16_t u16NormalIntsgEn;                     ///< SDIOC normal interrupt enable
            stc_sdioc_errintsgen_field_t stcNormalIntsgEn; ///< SDIOC normal interrupt enable bit-field structure
        };
    } stc_sdioc_normal_irq_en_t;

    /**
     *******************************************************************************
     ** \brief SDIOC normal interrupt enable structure
     **
     ******************************************************************************/
    typedef struct stc_sdioc_error_irq_en
    {
        union
        {
            uint16_t u16ErrorIntsgEn;                     ///< SDIOC error interrupt enable
            stc_sdioc_errintsgen_field_t stcErrorIntsgEn; ///< SDIOC error interrupt enable bit-field structure
        };
    } stc_sdioc_error_irq_en_t;

    /**
     *******************************************************************************
     ** \brief SDIOC error status callback functions
     **
     ******************************************************************************/
    typedef struct stc_sdioc_normal_irq_cb
    {
        func_ptr_t pfnCommandCompleteIrqCb; ///< Pointer to command complete callback function

        func_ptr_t pfnTransferCompleteIrqCb; ///< Pointer to transfer complete callback function

        func_ptr_t pfnBlockGapIrqCb; ///< Pointer to Block gap callback function

        func_ptr_t pfnBufferWriteReadyIrqCb; ///< Pointer to buffer write ready callback function

        func_ptr_t pfnBufferReadReadyIrqCb; ///< Pointer to buffer read ready callback function

        func_ptr_t pfnCardInsertIrqCb; ///< Pointer to card insertion callback function

        func_ptr_t pfnCardRemovalIrqCb; ///< Pointer to card removal callback function

        func_ptr_t pfnCardIrqCb; ///< Pointer to card interrupt callback function
    } stc_sdioc_normal_irq_cb_t;

    /**
     *******************************************************************************
     ** \brief SDIOC error status callback functions
     **
     ******************************************************************************/
    typedef struct stc_sdioc_error_irq_cb
    {
        func_ptr_t pfnCmdTimeoutErrIrqCb; ///< Pointer to command timeout error interrupt callback function

        func_ptr_t pfnCmdCrcErrIrqCb; ///< Pointer to command CRC error interrupt callback function

        func_ptr_t pfnCmdEndBitErrIrqCb; ///< Pointer to command end bit error interrupt callback function

        func_ptr_t pfnCmdIndexErrIrqCb; ///< Pointer to command index error interrupt callback function

        func_ptr_t pfnDataTimeoutErrIrqCb; ///< Pointer to data timeout error interrupt callback function

        func_ptr_t pfnDataCrcErrIrqCb; ///< Pointer to data CRC error interrupt callback function

        func_ptr_t pfnDataEndBitErrIrqCb; ///< Pointer to data end bit error interrupt callback function

        func_ptr_t pfnAutoCmdErrIrqCb; ///< Pointer to command error interrupt callback function
    } stc_sdioc_error_irq_cb_t;

    /**
     *******************************************************************************
     ** \brief SDIOC initialization configuration
     **
     ******************************************************************************/
    typedef struct stc_sdioc_init
    {
        stc_sdioc_normal_irq_en_t *pstcNormalIrqEn; ///< Pointer to normal interrupt enable structure

        stc_sdioc_normal_irq_cb_t *pstcNormalIrqCb; ///< Pointer to normal interrupt callback function structure

        stc_sdioc_error_irq_en_t *pstcErrorIrqEn; ///< Pointer to error interrupt enable structure

        stc_sdioc_error_irq_cb_t *pstcErrorIrqCb; ///< Pointer to error interrupt callback structure
    } stc_sdioc_init_t;

    /*******************************************************************************
     * Global pre-processor symbols/macros ('#define')
     ******************************************************************************/

    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

