MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/inc/hc32f46x_sdioc.h
    /*******************************************************************************
     * Global function prototypes (definition in C source)
     ******************************************************************************/
    void SDIOC_IrqHandler(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_Init(M4_SDIOC_TypeDef *SDIOCx,
                           const stc_sdioc_init_t *pstcInitCfg);
    en_result_t SDIOC_DeInit(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_SendCommand(M4_SDIOC_TypeDef *SDIOCx,
                                  const stc_sdioc_cmd_cfg_t *pstcCmdCfg);
    uint32_t SDIOC_GetResponse(const M4_SDIOC_TypeDef *SDIOCx,
                               en_sdioc_response_reg_t enRespReg);
    en_result_t SDIOC_ReadBuffer(M4_SDIOC_TypeDef *SDIOCx,
                                 uint8_t au8Data[],
                                 uint32_t u32Len);
    en_result_t SDIOC_WriteBuffer(M4_SDIOC_TypeDef *SDIOCx,
                                  uint8_t au8Data[],
                                  uint32_t u32Len);
    en_result_t SDIOC_ConfigData(M4_SDIOC_TypeDef *SDIOCx,
                                 const stc_sdioc_data_cfg_t *pstcDataCfg);
    en_result_t SDIOC_SdclkCmd(M4_SDIOC_TypeDef *SDIOCx,
                               en_functional_state_t enCmd);
    en_result_t SDIOC_SetClkDiv(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_clk_div_t enClkDiv);
    en_sdioc_clk_div_t SDIOC_GetClkDiv(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_SetClk(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32ClkFreq);
    en_result_t SDIOC_SetBusWidth(M4_SDIOC_TypeDef *SDIOCx,
                                  en_sdioc_bus_width_t enBusWidth);
    en_sdioc_bus_width_t SDIOC_GetBusWidth(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_SetSpeedMode(M4_SDIOC_TypeDef *SDIOCx,
                                   en_sdioc_speed_mode_t enSpeedMode);
    en_sdioc_speed_mode_t SDIOC_GetSpeedMode(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_SetDataTimeout(M4_SDIOC_TypeDef *SDIOCx,
                                     en_sdioc_data_timeout_t enTimeout);
    en_sdioc_data_timeout_t SDIOC_GetDataTimeout(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_SetCardDetectSignal(M4_SDIOC_TypeDef *SDIOCx,
                                          en_sdioc_detect_signal_t enDetectSignal);
    en_flag_status_t SDIOC_GetCardDetectTestLevel(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_BusPowerOn(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_BusPowerOff(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_StopAtBlockGapCmd(M4_SDIOC_TypeDef *SDIOCx,
                                        en_functional_state_t enCmd);
    en_result_t SDIOC_RestartTransfer(M4_SDIOC_TypeDef *SDIOCx);
    en_result_t SDIOC_ReadWaitCmd(M4_SDIOC_TypeDef *SDIOCx,
                                  en_functional_state_t enCmd);
    en_result_t SDIOC_InterruptAtBlockGapCmd(M4_SDIOC_TypeDef *SDIOCx,
                                             en_functional_state_t enCmd);
    en_result_t SDIOC_SoftwareReset(M4_SDIOC_TypeDef *SDIOCx,
                                    en_sdioc_sw_reset_t enSwResetType);
    en_flag_status_t SDIOC_GetStatus(M4_SDIOC_TypeDef *SDIOCx,
                                     en_sdioc_host_status_t enHostStatus);
    en_result_t SDIOC_NormalIrqSignalCmd(M4_SDIOC_TypeDef *SDIOCx,
                                         en_sdioc_nor_int_sel_t enNorInt,
                                         en_functional_state_t enCmd);
    en_result_t SDIOC_NormalIrqStatusCmd(M4_SDIOC_TypeDef *SDIOCx,
                                         en_sdioc_nor_int_sel_t enNorInt,
                                         en_functional_state_t enCmd);
    en_flag_status_t SDIOC_GetNormalIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                            en_sdioc_nor_int_flag_t enNorInt);
    en_result_t SDIOC_ClearNormalIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                         en_sdioc_nor_int_flag_t enNorInt);
    en_result_t SDIOC_ErrIrqSignalCmd(M4_SDIOC_TypeDef *SDIOCx,
                                      en_sdioc_err_int_sel_t enErrInt,
                                      en_functional_state_t enCmd);
    en_result_t SDIOC_ErrIrqStatusCmd(M4_SDIOC_TypeDef *SDIOCx,
                                      en_sdioc_err_int_sel_t enErrInt,
                                      en_functional_state_t enCmd);
    en_flag_status_t SDIOC_GetErrIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                         en_sdioc_err_int_flag_t enErrInt);
    en_result_t SDIOC_ClearErrIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                      en_sdioc_err_int_flag_t enErrInt);
    en_result_t SDIOC_ForceErrIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                      en_sdioc_err_int_sel_t enErrInt);
    en_flag_status_t SDIOC_GetAutoCmdErrStatus(M4_SDIOC_TypeDef *SDIOCx,
                                               en_sdioc_atuo_cmd_err_status_t enAutoCmdErr);
    en_result_t SDIOC_ForceAutoCmdErr(M4_SDIOC_TypeDef *SDIOCx,
                                      en_sdioc_atuo_cmd_err_sel_t enAutoCmdErr);

    //@} // SdiocGroup

#ifdef __cplusplus
}
#endif

#endif /* DDL_SDIOC_ENABLE */

#endif /* __HC32F46X_SDIOC_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
